{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "hidden_dim": 3072,
  "id2label": {
    "0": "happy",
    "1": "sad",
    "2": "calm",
    "3": "romantic",
    "4": "energetic",
    "5": "angry",
    "6": "neutral"
  },
  "initializer_range": 0.02,
  "label2id": {
    "angry": 5,
    "calm": 2,
    "energetic": 4,
    "happy": 0,
    "neutral": 6,
    "romantic": 3,
    "sad": 1
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "transformers_version": "4.57.3",
  "vocab_size": 30522
}
